Repository: Belarus/OmegaT-Common.TMX
Catalog: tmx/non-segmented/drupal-7.x.tmx
Source language: en
Languages: be

source: The Comment module allows users to comment on site content, set commenting defaults and permissions, and moderate comments. For more information, see the online handbook entry for <a href="@comment">Comment module</a>.
be: Модуль Comment дазваляе карыстальнікам каментаваць змест сайта, налажваць прадвызначанае каментаванне і правы, правяраць каментары. Для атрымання дадатковай інфармацыі, глядзіце ў сеціўным даведніку <a href="@comment">модуль Comment</a>.

source: The Contact module allows visitors to contact site administrators and other users. Users specify a subject, write their message, and can have a copy of their message sent to their own e-mail address. For more information, see the online handbook entry for <a href="@contact">Contact module</a>.
be: Модуль Contact дазваляе наведвальнікам звязвацца з адміністратарамі і іншымі карыстальнікамі. Карыстальнікі пазначаюць тэму, пішуць паведамленне, а таксама ў іх ёсць магчымасць даслаць копію паведамлення на сваю электронную пошту. Для дадатковай інфармацыі чытайце ў сеціўным даведніку пра <a href="@contact">модуль Contact</a>.

source: The Content translation module allows content to be translated into different languages. Working with the <a href="@locale">Locale module</a> (which manages enabled languages and provides translation for the site interface), the Content translation module is key to creating and maintaining translated site content. For more information, see the online handbook entry for <a href="@translation">Content translation module</a>.
be: Модуль Content translation дазваляе пераладаць змесціва на розныя мовы. Супраца гэтага модуля з модулем <a href="@locale">Locale</a> (які кіруе дазволенымі мовамі і забяспечвае пераклады для інтэрфейса сайта) з'яўляецца лепшым варыянтам для стварэння і падтрымкі перакладзенага змесціва сайта. Для дадатковай інфармацыі чытайце ў сеціўным дапаможніка пра модуль <a href="@translation">Content translation</a>.

source: The Contextual links module displays links related to regions of pages on your site to users with <em>access contextual links</em> permission. For more information, see the online handbook entry for <a href="@contextual">Contextual links module</a>.
be: Модуль Contextual links паказвае карыстальнікам з дазволам <em>Доступ да кантэкстных спасылак</em> спасылкі, звязаныя з рэгіёнамі старонак на вашым сайце. Для атрымання дадатковай інфармацыі глядзіце ў сеціўным даведніку пра модуль <a href="@contextual">Contextual links</a>.

source: The Dashboard module provides a <a href="@dashboard">Dashboard page</a> in the administrative interface for organizing administrative tasks and navigation, and tracking information within your site. The Dashboard page contains blocks, which you can add to and arrange using the drag-and-drop interface that appears when you click on the <em>Customize dashboard</em> link. Within this interface, blocks that are not primarily used for site administration do not appear by default, but can be added via the <em>Add other blocks</em> link. For more information, see the online handbook entry for <a href="@handbook">Dashboard module</a>.
be: Модуль Dashboard прадстаўляе <a href="@dashboard">Старонку прыладаў</a> у адміністратарскім інэрфейсе для арганізацыі адміністратарскіх задач і навігацыі, а таксама адсочвання інфармацыі на вашым вэбсайце. Страронка прыладаў утрымлівае блокі, якія вы можаце дадаваць і вызначаць, выкарыстоўваючы інтэрфейс "пеацягнуў і кінуў", які з'яўляецца, калі вы націскаеце на спасылцы <em>адаптаваць прылады па патрэбах</em>. У гэтым інтэрфейсе блокі, якія не часта выкарыстоўваюцца будуць схаваны па змоўчаню, але могуць быць дададзеныя праз спасылку <em>Дадаць іншыя блокі</em>. Для атрымання большых звестак глядзіце запісы анлайн дапаможніка для <a href="@handbook">модуля Dashboard</a>.

source: The Database logging module allows you to view an event log on the <a href="@dblog">Recent log messages</a> page. The log is a chronological list of recorded events containing usage data, performance data, errors, warnings and operational information. Administrators should check the log on a regular basis to ensure their site is working properly.
be: Модуль Database logging дазваляе вам праглядаць журнал падзеяў на старонцы <a href="@dblog">Апошніх паведамленняў журнала</a>. Журнал ёсць спіс падзеяў, устрымліваючых вакарыстоўваемыя дадзеныя, прадстаўленыя дадзеныя, памылкі, папярэджанні і аперацыйную інфармацыю. Адміністратарам варта правяраць журнал рэгулярна, каб упэўніцца, што ваш сайт працуе добра.

source: The Database logging module logs system events in the Drupal database. For more information, see the online handbook entry for the <a href="@dblog">Database logging module</a>.
be: Database logging модуль запісвае сістэмныя падзеі ў базе дадзеных Drupal. Для атрымання большай інфармацыі глядзіце анлайн дапаможнік модуля <a href="@dblog">Database logging</a>.

source: The Database logging module monitors your website, capturing system events in a log (shown here) to be reviewed by an authorized individual at a later time. This log is a list of recorded events containing usage data, performance data, errors, warnings and operational information. It is vital to check the Recent log messages report on a regular basis, as it is often the only way to tell what is going on.
be: Модуль Database logging назірае за вашым сайтам, захоплівае сістэмныя падзеі ў журнал (паказаныя тут) якія могуць быць прагледжаныя аўтарызаваным карыстальнікам пазней. Гэты журнал уяўляе сабой спіс захаваных падзеяў, утрымліваючых выкарыстаныя дадзеныя, прадстаўленыя дадзеныя, памылкі, папярэджанні і аперацыйную інфармацыю. Важна правяраць Журнал апошніх паведамленняў рэгулярна, бо ён часта паказвае, што адбываецца на сайце.

source: The English language cannot be deleted.
be: Англійская мова не можа быць выдалена.

source: The Field SQL storage module stores field data in the database. It is the default field storage module; other field storage mechanisms may be available as contributed modules. See the <a href="@field-help">Field module help page</a> for more information about fields.
be: Модуль Field SQL storage захоўвае дадзеныя ў базе. Гэты модуль захавання дадзеных палёў па змоўчанні. Іншыя механізмы захавання палёў могуць быць дазволены таксама ўнесенымі модулямі. Глядзіце старонку дапамогі модуля <a href="@field-help">Field</a> для атрымання большых звестак аб палях.

source: The Field UI module provides an administrative user interface (UI) for attaching and managing fields. Fields can be defined at the content-type level for content items and comments, at the vocabulary level for taxonomy terms, and at the site level for user accounts. Other modules may also enable fields to be defined for their data. Field types (text, image, number, etc.) are defined by modules, and collected and managed by the <a href="@field">Field module</a>. For more information, see the online handbook entry for <a href="@field_ui" target="_blank">Field UI module</a>.
be: Модуль Field UI забяспечвае адміністрацыйны карыстальніцкі інтэрфейс (UI) для далучэння і кіравання палямі. Палі могуць быць вызначаны на ўзроўні тыпу змесціва для ўтрымання элементаў і каментароў, на ўзроўні слоўніка для тэрмінаў таксанаміі, і на ўзроўні сайта для карыстальніцкіх контаў. Іншыя модулі могуць таксама дазваляць палі, вызначаныя для сваіх дадзеных. Палі тыпаў (тэкст, малюнак, лік і г.д.) вызначаюцца модулямі, яны збіраюцца і кіруюцца <a href="@field">модулем Field</a>. Для атрымання дадатковай інфармацыі, глядзіце анлайн даведнік па спасылцы <a href="@field_ui" target="_blank">модуль Field UI</a>.

source: The Field module allows custom data fields to be defined for <em>entity</em> types (entities include content items, comments, user accounts, and taxonomy terms). The Field module takes care of storing, loading, editing, and rendering field data. Most users will not interact with the Field module directly, but will instead use the <a href="@field-ui-help">Field UI module</a> user interface. Module developers can use the Field API to make new entity types "fieldable" and thus allow fields to be attached to them. For more information, see the online handbook entry for <a href="@field">Field module</a>.
be: Модуль Field дазваляе вызначаць палі дадзеных своранных карыстальнікамі як тыпы <em>сутнасці</em> (сутнасці ўключаюць элементы кантэнту, каментары, акаунты карыстальнікаў і тэрміны таксанаміі). Модуль Field бярэ пад увагу захаванне, загрузку, рэдагаванне і вывад дадзеных палёў.\r Большасць карастальнікаў напрамую не ўзаемадзенічае з модулем Field. Але замест выкарастоўвае модуль <a href="@field-ui-help">Field UI</a> са зручным графічным інтэрфейсам. Распацоўшчыкі модуляў могуць выкарыстоўваць Field API, каб рабіць тыпы новых сутнастяў "палявымі" і гэткім чынам дазваляюць палям быць далучанымі да модуляў. Для атрымання большых звестак глядзіце звесткі анлайн дапаможніку пра <a href="@field">модуль Field</a>.

source: The Field module provides the infrastructure for fields and field attachment; the field types and input widgets themselves are provided by additional modules. Some of the modules are required; the optional modules can be enabled from the <a href="@modules">Modules administration page</a>. Drupal core includes the following field type modules: Number (required), Text (required), List (required), Taxonomy (optional), Image (optional), and File (optional); the required Options module provides input widgets for other field modules. Additional fields and widgets may be provided by contributed modules, which you can find in the <a href="@contrib">contributed module section of Drupal.org</a>. Currently enabled field and input widget modules:
be: Молуль Field прадстаўляе інфраструктуру для палёў і палёў з прышчэпленымі файламі, тыпы палёў і віджэтаў самі прадастаўлены дададковымі модулямі. Некаторыя модулі - абавязковыя. Модулі па жаданню могуць быць дазволеныя на старонцы <a href="@modules">Адміністравання Модуляў</a>. Drupal ядро ўключае наступныя модулі полеў: Number (абавязковы), Text (абавязковы), List (абавязковы), Taxonomy (па жаданню), Image (па жаданню), and File (па жаданню). Абавязковы модуль Options праўстаўляе віджэты ўводу для іншых модуляў. Дададковыя палі і віджэты могуць быць прадастаўленыя ўнесенымі модулямі, якія вы можаце знайсці ў секцыі <a href="@contrib">Унесеных Модуляў на Drupal.org</a>. Бягучыя дазволеныя модулі поля і віджэта ўводу:

source: The File module allows users to attach files to content (e.g., PDF files, spreadsheets, etc.), when a <em>File</em> field is added to a given content type using the <a href="@fieldui-help">Field UI module</a>. You can add validation options to your File field, such as specifying a maximum file size and allowed file extensions.
be: Модуль File дазваляе карыстальнікам прычэпліваць файлы да зместу (напрыклад, PDF-файлы, разліковыя аркушы і г.д.), калі поле <em>File</em> дададзена да дадзеннага тыпу зместу, выкарыстоўваецца модуль <a href="@fieldui-help">Field UI</a>. Вы можаце дадаць наладкі кантролю для вашага поля File, напрыклад, калі ўкажыце максімальны памера файла ці дазволеныя пашырэнні файлаў.

source: The File module defines a <em>File</em> field type for the Field module, which lets you manage and validate uploaded files attached to content on your site (see the <a href="@field-help">Field module help page</a> for more information about fields). For more information, see the online handbook entry for <a href="@file">File module</a>.
be: Модуль File вызначае тып поля <em>Файла</em> для модуля Field, які дазваляе вам кіраваць і зацвярджаць загружаныя файлы, далучаныя да змесціва на вашым сайце (каб даведацца больш пра палі, глядзіце <a href="@field-help">старонку дапамогі модуля Field</a>). Каб атрымаць дадатковую інфармацыю, глядзіце ў сеціўным даведніку <a href="@file">модуль File</a>.

source: The Filter module allows administrators to configure text formats. A text format defines the HTML tags, codes, and other input allowed in content and comments, and is a key feature in guarding against potentially damaging input from malicious users. For more information, see the online handbook entry for <a href="@filter">Filter module</a>.
be: Модуль Filter дазваляе адміністратарам канфігураваць тэкставыя фарматы. Тэкставы фармат вызначае тэгі HTML, коды і другія ўваходныя дадзеныя, дазволеныя ў змесціве і каментарах, і адной з асноўных функцый якога з'яўляецца абарона ад уводу патэнцыйна разбуральных дадзеных з боку злосных карыстальнікаў. Каб атрымаць дадатковую інфармацыю, глядзіце ў сеціўным даведніку <a href="@filter">модуль Filter</a>.

source: The Forum module lets you create threaded discussion forums with functionality similar to other message board systems. Forums are useful because they allow community members to discuss topics with one another while ensuring those conversations are archived for later reference. In a forum, users post topics and threads in nested hierarchies, allowing discussions to be categorized and grouped. The forum hierarchy consists of:
be: Модуль Forum дазваляе ствараць дрэва дыскусій форумаў з функцыянальнасцю падобнай да іншых дошак абвестак. Форумы з'яўляюцца карыснымі, паколькі яны дазваляюць членам супольнасці абмяркоўваць пытанні адзін з адным, у той час як гэтыя размовы архівуюцца для наступнага выкарыстання. На форуме карыстальнікі размяшчаюць тэмы і падтэмы, гэта дазваляе дыскусіям быць класіфікаванымі і згрупаванымі. Іерархія форума складаецца з:

source: The GD Library for PHP is enabled, but was compiled without support for functions used by the rotate and desaturate effects. It was probably compiled using the official GD libraries from http://www.libgd.org instead of the GD library bundled with PHP. You should recompile PHP --with-gd using the bundled GD library. See <a href="http://www.php.net/manual/book.image.php">the PHP manual</a>.
be: GD бібліятэка для PHP уключана, аднак яна была складзена без падтрымкі функцый, якія выкарыстоўваюцца эфектамі паніжэння насычанасці і вярчэння. Мабыць, яна была складзена з выкарыстаннем афіцыйных GD бібліятэк з http://www.libgd.org, замест GD бібліятэкі, уключанай у PHP. Вы павінны нанова скласці PHP -- з-gd, выкарыстоўваючы для гэтага ўключаную GD бібліятэку. Глядзіце <a href="http://www.php.net/manual/book.image.php">даведнік PHP</a>.

source: The GD image toolkit requires that the GD module for PHP be installed and configured properly. For more information see <a href="@url">PHP's image documentation</a>.
be: Інструмент GD для выяваў патрабуе, каб модуль GD для PHP быў усталяваны і адпаведна наладжаны. Для большых звествак глядзіце <a href="@url">дакументцыю PHP для выяваў</a>.

source: The GD library for PHP is enabled, but was compiled without PNG support. Check the <a href="@url">PHP image documentation</a> for information on how to correct this.
be: Бібліятэка GD уключана для PHP, але яна была скампілявана без падтрымкі PNG. Праверце <a href="@url"> дакументацыю PHP малюнкаў </a> для атрымання інфармацыі, як выправіць гэта.

source: The GD library for PHP is missing or outdated. Check the <a href="@url">PHP image documentation</a> for information on how to correct this.
be: Бібліятэка GD для PHP адсутнічае або састарэла. Праверце <a href="@url"> дакументацыю PHP малюнкаў </a> для атрымання інфармацыі, як выправіць гэта.

source: The GD toolkit is installed and working properly.
be: Набор інструментаў GD усталяваны і працуе як належыць.

source: The HTML ID %id is unique.
be: HTML ID %id унікальны.

source: The Help module displays context-sensitive advice and explanations on various pages.
be: Модуль Help адлюстроўвае парады, адчувальныя да кантэксту, і тлумачэнні на розных старонках.

source: The Help module displays explanations for using each module listed on the main <a href="@help">Help reference page</a>.
be: Модуль Help адлюстроўвае тлумачэнні па ўжыванню кожнага модуля, пералічанага на галоўнай старонцы <a href="@help">спасылак дапаможніка</a>.

source: The Help module provides <a href="@help-page">Help reference pages</a> and context-sensitive advice to guide you through the use and configuration of modules. It is a starting point for the online <a href="@handbook">Drupal handbooks</a>. The handbooks contain more extensive and up-to-date information, are annotated with user-contributed comments, and serve as the definitive reference point for all Drupal documentation. For more information, see the online handbook entry for the <a href="@help">Help module</a>.
be: Модуль Help прадстаўляе <a href="@help-page">звязанныя старонкі дапамогі</a> і кантэкстна адчувальныя парады для выкарыстання і наладкі модуляў. Гэта стартавы пункт у сеціўных <a href="@handbook">даведніках Drupal</a>. Гэтыя даведнікі ўтрымліваюць больш падрабязную і актуальную інфармацыю, дапоўнены каментарамі карыстальнікамі і ўтрымліваюць спасылкі на ўсю адпаведную дакументацыю Drupal. Каб атрымаць дадатковую інфармацыю, глядзіце ў сеціўным даведніку <a href="@help">модуль Help</a>.

source: The IP address %ip has been blocked.
be: IP адрас %ip быў заблакаваны.

source: The IP address %ip was deleted.
be: IP адрас %ip быў выдалены.

source: The IP address of the computer the comment was posted from.
be: IP адрэса кампутара з якога быў зроблены каментар.

source: The IP address of the user.
be: IP-адрас карыстальніка

source: The Image module allows you to manipulate images on your website. It exposes a setting for using the <em>Image toolkit</em>, allows you to configure <em>Image styles</em> that can be used for resizing or adjusting images on display, and provides an <em>Image</em> field for attaching images to content. For more information, see the online handbook entry for <a href="@image">Image module</a>.
be: Модуль Image дазваляе вам кіраваць малюнкамі на вашым сайце. Ён дае магчымасць выкарыстоўваць <em>Набор інструментаў для малюнкаў</em>, дазваляе вам канфігураваць <em>Стылі малюнкаў</em>, якія могуць выкарыстоўвацца для змены памераў ці наладкі малюнкаў для адлюстравання, а таксама забяспечвае поле <em>Малюнак</em>, якое дазваляе далучаць малюнкі да змесціва. Каб атрымаць дадатковую інфармацыю, глядзіце ў сеціўным даведніку <a href="@image">модуль Image</a>.

source: The List module defines various fields for storing a list of items, for use with the Field module. Usually these items are entered through a select list, checkboxes, or radio buttons. See the <a href="@field-help">Field module help page</a> for more information about fields.
be: Модуль List вызначае розныя палі для захавання спісаў элементаў, выкарыстоўваецца сумесна з модулем Field. Звычайна гэтыя элементы ўводзяцца праз выпадаючы спіс, чэкбоксы ці радыё кнопкі. Глядзіце старонку дапамогі <a href="@field-help">модуля Field</a> для атрымання большых звестак пра палі.

source: The Locale module allows your Drupal site to be presented in languages other than the default English, and to be multilingual. The Locale module works by maintaining a database of translations, and examining text as it is about to be displayed. When a translation of the text is available in the language to be displayed, the translation is displayed rather than the original text. When a translation is unavailable, the original text is displayed, and then stored for review by a translator. For more information, see the online handbook entry for <a href="@locale">Locale module</a>.
be: Модуль Locale дазваляе адлюстраванне вашага Drupal сайта на мовах, адрозных ад мовы па змоўчанні, і зрабіць яго шматмоўным. Модуль Locale працуе, падтрымліваючы базу дадзеных перакладаў, і правярае тэкст на магчымасць адлюстравання. Калі пераклад тэкста даступны для адлюстравання на абранай мове, тады ён будзе паказаны замест арыгінальнага тэкста. Калі пераклад адсутнічае, тады адлюстроўваецца арыгінальны тэкст, які таксама захаваўваецца для прагляду перакдадчыкам. Каб атрымаць дадатковую інфармацыю, глядзіце ў сеціўным даведніку <a href="@locale">модуль Locale</a>.

source: The MIME type of the file.
be: Файл тыпа MIME.

source: The Menu module provides an interface for managing menus. A menu is a hierarchical collection of links, which can be within or external to the site, generally used for navigation. Each menu is rendered in a block that can be enabled and positioned through the <a href="@blocks">Blocks administration page</a>. You can view and manage menus on the <a href="@menus">Menus administration page</a>. For more information, see the online handbook entry for the <a href="@menu">Menu module</a>.
be: Модуль Menu падае інтэрфейс для кіравання меню. Меню – гэта іерархічная сукупнасць спасылак, якія могут быць унутры ці звонку сайта , звычайна выкарыстоўваюцца для навігацыі. Кожны пункт меню прадстаўляе сабой блок, які знаходзіцца і ўсталёўваецца праз <a href="@blocks"> Старонку кіравання блокамі </a>. Вы можаце праглядзець і кіраваць меню на <a href="@menus">Старонцы кіравання меню </a>. Для больш падрабязнай інфармацыі глядзіце анлайн-даведнік у <a href="@menu">Модулі Menu </a>.

source: The Node module also enables you to create multiple versions of any content, and revert to older versions using the <em>Revision information</em> settings.
be: Модуль Node таксама дазваляе вам ствараць шмат версій для любога матэрыяла, вяртацца да папярэдняй версіі, выкарыстоўваючы наладкі <em>Інфармацыі версій</em>.

source: The Node module gives users with the <em>Administer content types</em> permission the ability to <a href="@content-new">create new content types</a> in addition to the default ones already configured. Creating custom content types allows you the flexibility to add <a href="@field">fields</a> and configure default settings that suit the differing needs of various site content.
be: Модуль Node дае карыстальнікам з правамі <em>Адміністравання тыпаў змесціва</em> магчымасць <a href="@content-new">стварыць новыя тыпы змесціва</a> ў дадатак да звычайных, якія былі ужо наладжаны. Стварэнне карыстацкіх тыпаў змесціва дазваляе лёгка дадаваць <a href="@field">палі</a> і змяняць звычайныя наладкі, якія адпавядаюць рознаму змесціву сайта.

source: The Node module makes a number of permissions available for each content type, which can be set by role on the <a href="@permissions">permissions page</a>.
be: Модуль Node робіць даступнымі колькасць правоў для кожнага тыпу змесціва, якія могуць быць наладжаны роляй на <a href="@permissions">старонцы правоў</a>.

source: The Node module manages the creation, editing, deletion, settings, and display of the main site content. Content items managed by the Node module are typically displayed as pages on your site, and include a title, some meta-data (author, creation time, content type, etc.), and optional fields containing text or other data (fields are managed by the <a href="@field">Field module</a>). For more information, see the online handbook entry for <a href="@node">Node module</a>.
be: Модуль Node кіруе стварэннем, рэдагаваннем, выдаленнем наладкамі, адлюстроўваннем асноўнага зместу сайта. Элементы зместу, якія кіруюцца модулем Node, тыпова адлюстроўваюцца як старонкі сайта, і ўключаюць ў сябе загаловак, некаторыя мета-дадзеныя (аўтара, час стварэння, тып змесціва, і г.д.), і дадатковыя палі, якія ўтрымліваюць тэкст або іншыя дадзеныя (палі кіруюцца <a href="@field">модулем Field</a>). Для атрымання дадатковай інфармацыі глядзіце анлайн даведнік для <a href="@node">модуля Node</a>.
